WebContent/wsdl/greetingimpl.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions name="GreetingImplService" targetNamespace="http://consumer.service.com.co/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:tns="http://consumer.service.com.co/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
  <wsdl:types>
    <xs:schema elementFormDefault="unqualified" targetNamespace="http://consumer.service.com.co/" version="1.0" xmlns:tns="http://consumer.service.com.co/" xmlns:xs="http://www.w3.org/2001/XMLSchema">
<xs:element name="greetingWithName" type="tns:greetingWithName"/>
<xs:element name="greetingWithNameResponse" type="tns:greetingWithNameResponse"/>
<xs:complexType name="greetingWithName">
<xs:sequence>
<xs:element minOccurs="0" name="arg0" type="xs:string"/>
</xs:sequence>
</xs:complexType>
<xs:complexType name="greetingWithNameResponse">
<xs:sequence>
<xs:element minOccurs="0" name="return" type="xs:string"/>
</xs:sequence>
</xs:complexType>
</xs:schema>
  </wsdl:types>
  <wsdl:message name="greetingWithName">
    <wsdl:part name="parameters" element="tns:greetingWithName">
    </wsdl:part>
  </wsdl:message>
  <wsdl:message name="greetingWithNameResponse">
    <wsdl:part name="parameters" element="tns:greetingWithNameResponse">
    </wsdl:part>
  </wsdl:message>
  <wsdl:portType name="IGreeting">
    <wsdl:operation name="greetingWithName">
      <wsdl:input name="greetingWithName" message="tns:greetingWithName">
    </wsdl:input>
      <wsdl:output name="greetingWithNameResponse" message="tns:greetingWithNameResponse">
    </wsdl:output>
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="GreetingImplServiceSoapBinding" type="tns:IGreeting">
    <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="greetingWithName">
      <soap:operation soapAction="urn:GreetingWithName" style="document"/>
      <wsdl:input name="greetingWithName">
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output name="greetingWithNameResponse">
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="GreetingImplService">
    <wsdl:port name="GreetingImplPort" binding="tns:GreetingImplServiceSoapBinding">
      <soap:address location="http://localhost:8080/SampleService/services/GreetingImplPort"/>
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>
